<a href="https://colab.research.google.com/github/2303A51859/ADM/blob/main/LAB_EXAM.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

In [2]:
#Loading dataset
df=pd.read_csv('/content/university_student.csv')

In [6]:
#identifying and handling missing values
df.isna().sum()

Student ID       0
Gender           0
Date of Birth    0
Study Time       0
Grade            0
School Type      0
Absences         0
Math Score       0
Reading Score    0
Writing Score    0
dtype: int64

In [8]:
df['Gender'].fillna(df['Gender'].mode())

0       Male
1     Female
2       Male
3       Male
4       Male
       ...
95    Female
96    Female
97    Female
98    Female
99      Male
Name: Gender, Length: 100, dtype: object

In [20]:
from sklearn.preprocessing import OneHotEncoder
EnCoder=OneHotEncoder(sparse_output=False)

In [21]:
df['Gender']=EnCoder.fit_transform(df[['Gender']]) # Also, OneHotEncoder expects a 2D array, so use df[['gender']] instead of df['gender']

In [26]:
df['School Type']=EnCoder.fit_transform(df[['School Type']])

#calculate mean ,median and mode

In [29]:
print(df['Math Score'].mean())

76.03

In [31]:
print(df['Math Score'].median())

74.5

In [32]:
print(df['Math Score'].mode())

0    61
1    72
2    84
3    85
4    98
Name: Math Score, dtype: int64

In [34]:
print(df['Math Score'].std())

13.48134138936351

In [37]:
res=df.groupby('School Type')['Math Score'].sum()

In [38]:
print(res)

School Type
0.0    3112
1.0    4491
Name: Math Score, dtype: int64